{
  "name": "PVD Correlated Report",
  "namespace": "Stanford\\CorrelatedReport",
  "description": "PVD Correlated Report Proof of Concept.",
  "authors": [
    {
      "name": "Ihab Zeedia",
      "email": "ihabz@stanford.edu",
      "institution": "Stanford University"
    }
  ],
  "links": {
    "project": [
      {
        "name": "Main Report Page",
        "icon": "brick",
        "url": "view/index.php",
        "show-header-and-footer": false
      }
    ]
  },
  "project-settings": [
    {
      "key": "description",
      "name": "<h6 style='text-align:center;color:red'><b>Organize project fields into an easy-to-read table</b></h6>This tool allows users to format data from your project into an easy-to-read table structure. Summarize uses the configuration specified below to determine which fields to include and how to display the data. HTML is generated for each record and each configuration and the html is stored in a project field that is specified in the configuration. The html can then be piped to a descriptive field to be displayed on a project form or can be used to pipe project information into emails or surveys.<br><br>The data that can be used in a Summarize table is confined to project fields in the same event.  If you would like to display project fields across events or fields from another project, please use the Data Table External Module instead.",
      "type": "descriptive"
    },
    {
      "key": "description4",
      "name": "<h6 style='color:red;'><b>Project Debugging Option</b></h6>This will allow for extra debugging statements to be written to the project log files for the whole project - not just one configuration.",
      "type": "descriptive"
    },
    {
      "key": "enable-project-debug-logging",
      "name": "<b>Enable Debug Logging</b></h6><i> (Requires emLogger)</i><br>If you have questions enabling debugging, please contact the REDCap team for help.",
      "required": false,
      "type": "checkbox",
      "source": "js/config.js",
      "functionName": "SummarizeConfig.init"
    }
  ]
}